app/views/cart/index.html.erb

SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
<ul> <% @cart.each do |id,quantity| %>
	<% movie=Movie.find_by_id (id) %>