app/controllers/movies_controller.rb

  def index
  @flag = 1
  @movies = Movie.all
---
SELECT `movies`.* FROM `movies`

  def show
@reviews=Review.where(movie_id: @movie.id).order("created_at DESC")

if @reviews.blank?
@avg_review=0
else
@avg_review=@reviews.average(:rating).round(2)
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` = 1  ORDER BY created_at DESC
SELECT AVG(`reviews`.`rating`) FROM `reviews` WHERE `reviews`.`movie_id` = 1

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`title`, `poster_url`, `genres`, `year`, `imdb_rating`, `length`, `worldwide_gross`, `studio`, `price`, `created_at`, `updated_at`) VALUES ('Korea wali Rebecca', 'something.jpg', 'Horror', 420, 0, 5, '0', 'Veteran 550', 1, '2015-10-22 02:16:48', '2015-10-22 02:16:48')

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1