app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id=current_user.id
@review.movie_id=@movie.id
    if @review.save
---
INSERT INTO `reviews` (`rating`, `comment`, `user_id`, `movie_id`, `created_at`, `updated_at`) VALUES (1, 'sk', 1, 1, '2015-10-24 00:47:27', '2015-10-24 00:47:27')

  def destroy
    @review.destroy
---
DELETE FROM `reviews` WHERE `reviews`.`id` = 1

    def set_review
      @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 4 LIMIT 1

def set_movie
@movie=Movie.find(params[:movie_id])
---
SELECT  `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1